import type { Activity } from "@/types/education.types";

export const activitiesFa: Activity[] = [
  {
    title: "ارائه مهندسی پراپمت",
    image: "/images/education/HBH-presentation.jpg",
    description:
      "به‌عنوان بخشی از برنامه علمی «هفته به هفته»، ارائه‌ای درباره حوزه نوظهور مهندسی پرامپت داشتم. در این جلسه مفاهیم کلیدی، کاربردهای عملی و فرصت‌های آینده طراحی پرومپت در سیستم‌های هوش مصنوعی معرفی شد و دانشجویان و اساتید در بحث‌هایی درباره نقش پرامپت های مؤثر در حل مسئله و نوآوری مشارکت کردند."
  },
  {
    title: "مسابقه امنیتی Urmia CTF (UCTF)",
    image: "/images/education/UCTF.jpg",
    description:
      "به‌عنوان عضو تیم اجرایی در مسابقه دانشجویی امنیت سایبری UCTF که به‌طور مشترک توسط دانشگاه ارومیه و دانشگاه صنعتی ارومیه برگزار شد، همکاری داشتم. علاوه بر پشتیبانی از اجرای روان رویداد، مسئولیت بازطراحی وب‌سایت رسمی را برعهده گرفتم که باعث بهبود تجربه کاربری، طراحی بصری و رضایت شرکت‌کنندگان شد."
  },
  {
    title: "عضویت در انجمن علمی مهندسی کامپیوتر",
    image: "/images/education/Association-cert.jpg",
    description:
      "به‌عنوان عضو فعال انجمن مهندسی کامپیوتر، دو سال در مجموعه‌ای گسترده از فعالیت‌های علمی و اجتماعی مشارکت داشتم. این فعالیت‌ها شامل برگزاری کارگاه‌ها و سمینارهای فناوری‌های نو، همکاری در برگزاری مسابقات برنامه‌نویسی و رویدادهای فنی، و مشارکت در جلسات دانش‌افزایی برای حمایت از دانشجویان بود. این تجربه مهارت‌های کار تیمی، رهبری و ارتباطات من را تقویت کرد و فرصتی برای خدمت به جامعه دانشگاهی فراهم آورد."
  },
  {
    title: "رویداد شب علم",
    image: "/images/education/Science-night.jpg",
    description:
      "به‌عنوان نماینده دانشکده مهندسی برق و کامپیوتر در رویداد «شب علم» که در پردیس علم و فناوری دانشگاه ارومیه برگزار شد و بیش از ده هزار بازدیدکننده داشت، حضور داشتم. در غرفه مربوطه، دانشجویان و عموم مردم را با رشته مهندسی کامپیوتر، برنامه‌های آموزشی دانشگاه و فعالیت‌های مرتبط آشنا کردم. نقش من شامل توضیح فرصت‌های این رشته، پاسخ به پرسش‌ها و کمک به بازدیدکنندگان برای درک بهتر اهمیت علوم کامپیوتر در دنیای امروز بود."
  },
  {
    title: "گروه کاربران لینوکس ارومیه (UrumLUG)",
    image: "/images/education/Urumlug.jpg",
    description:
      "به‌طور منظم در جلسات گروه کاربران لینوکس ارومیه که یک جامعه دانشجویی متمرکز بر فناوری‌های متن‌باز و سیستم‌های لینوکس است شرکت می‌کردم. این نشست‌ها فرصتی برای بررسی کاربردهای عملی لینوکس، اشتراک دانش در مدیریت سیستم و امنیت، و گفتگو درباره اکوسیستم متن‌باز فراهم می‌کرد. مشارکت من باعث شد دانش فنی‌ام عمیق‌تر شود و با هم‌دانشجویانی که علاقه‌مند به یادگیری مشارکتی و نرم‌افزار آزاد بودند ارتباط برقرار کنم."
  }
];
