import type { Book } from "@/types/books.types";

export const BooksFa: Book[] = [
    {
    title: "علم داده از ابتدا (صفر)",
    author: "جوئل گروس",
    cover: "/images/books/ds.png",
    category: "computer science",
    description: "برای یادگیری واقعی علم داده، نه تنها باید بر ابزارها - کتابخانه های علوم داده، چارچوب ها، ماژول ها و جعبه ابزار - تسلط داشته باشید، بلکه باید ایده ها و اصول زیربنای آنها را نیز درک کنید. به‌روزرسانی شده برای Python 3.6، این ویرایش دوم Data Science from Scratch به شما نشان می‌دهد که چگونه این ابزارها و الگوریتم‌ها با پیاده‌سازی آنها از ابتدا کار می‌کنند.",
    review: "یکی از اولین کتاب ها در حوزه تخصصی خودم است که بسیار از خواندن آن لذت میبرم. متن کاملا واضح و توضیحات ساده باعث شد این کتاب را بنیان تخصصم در علم داده قرار بدهم.",
    rating: 5,
    
    },
    {
        title: "وسعت یا عمق؟",
        author: "دیوید اپستین",
        category: "psychology",
        cover: "/images/books/range.png",
        description: "کتاب وسعت یا عمق اثر پرفروش دیوید اپستین و منتشرشده در سال ۲۰۱۹ است. در این کتاب توضیح داده می‌شود که موثرترین راه برای موفقیت در هر حوزه‌ای، ممکن است آن راهی که در ابتدا به نظر می‌رسد، نباشد. بسیاری از ما در دنیای مدرن، ممکن است نحوه‌ی صحیح رسیدن به اهداف و همچنین حرکت کردن در مسیر مورد علاقه‌مان را به درستی انتخاب نکنیم، زیرا بسیاری از مسائلی که امروزه تحت عنوان ارزش در این مسیر عنوان می‌شوند، ممکن است در اصل چندان درست نباشند",
        review: "بعد از پایان این کتاب دید متفاوت و عمیقی به مسائل و تصمیمات روزمره و هدف های بلند مدتم در زندگی پیدا کردم و برای کسانی که در شروع مسیر سخت زندگی خود هستند توصیه میکنم.",
        rating: 4 
    },
    {
        title: "1984",
        author: "جورج اورول",
        category: "novel",
        cover: "/images/books/1984.png",
        description: "کتاب ۱۹۸۴ رمان مشهور جورج اورول و داستانی بر پایه‌‌ی نقد جامعه‌‌ی آینده است. این رمان به همراه «قلعه‌‌ی حیوانات»، باعث شهرت جهانی جورج اورول شدند. اورول این کتاب را در سال ۱۹۴۹ نوشت. این اثر تاکنون به ۶۵ زبان ترجمه شده است. رمان دیستوپیایی اورول، تمام جهان را کمونیستی فرض می‌‌کند که راه فراری از آن نیست و قدرت از بالای حاکمیت و ناعدالتی در جامعه را نشان می‌‌دهد.",
        review: " جملاتی بسیار دقیق و داستان سازی هوشمند درباره هر آنچه باید در مورد حکومت های دیکتاتوری و کمونیستی باید دانست...",
        rating: 5

    },
    {
        title: "بادبادک باز",
        author: "خالد حسینی",
        category: "novel",
        cover: "/images/books/kite.png",
        description: "کتاب بادبادک باز اولین رمان خالد حسینی، نویسنده‌ افغانستانی‌تبار ساکن آمریکاست. حسینی در این رمان به سراغ زادگاهش، افغانستان، می‌رود و داستان معصومیتی را روایت می‌کند که قربانی تعصبات قومی و مذهبی می‌شود؛ روایتی از دوستی، وفاداری، خیانت، مهاجرت و رنج‌های مردمی در دل خاورمیانه که خواننده را به سفری پرفرازونشیب در بستر تحولات تاریخی افغانستان می‌برد",
        review: "داستان تاثیرگذار و روند پیش روی داستان بسیار جالب بود که میتونست ساعت ها توجه آدم رو به خودش جلب کنه",
        rating: 5

    },
    {
        title: " دیوان شهریار",
        author: "شهریار",
        category: "poetry",
        cover: "/images/books/shahriar.png",
        description: "کتاب دیوان شهریار بیش از صد ها شعر به زبان فارسی ترکی از سید محمدحسین بهجت تبریزی متخلص به شهریار را در بر دارد.",
        review: " شاعر مورد علاقه خودم که اگر صد ها بار شعرهایش را بخوانم باز هم از آرامش و زیبایی تک تک کلماتش لذت میبرم. ",
        rating: 5

    },
    {
        title: "اشراف زادگان فقیر",
        author: "رضا حیات الغیب",
        category: "psychology",
        cover: "/images/books/ashraf.png",
        description: "کتاب «اشراف‌زادگان فقیر» اثر رضا حیات‌الغیب، روایتگر زندگی طبقه‌ای از جامعه است که گرچه اصالت و نام خانوادگی‌شان بر جای مانده، اما در تنگنای مالی و اجتماعی روزگار می‌گذرانند. نویسنده با نگاهی انسانی و واقع‌گرایانه تضاد میان ظاهر و واقعیت را به تصویر می‌کشد و نشان می‌دهد که شکوه گذشته، همواره تضمین‌کننده آرامش حال نیست.",
        rating: 3

    },
    {
        title: "ارومیه در محاربه عالم سوز",
        author: "رحمت الله خان معتمد الوزاره",
        category: "history",
        cover: "/images/books/urmia.png",
        description: "کاوه بیات در کتاب ارومیه در محاربه عالم سوز شرحی از اتفاقاتی که پس از جنگ جهانی اول در ارومیه رخ داد، ارائه داده است. در طول جنگ جهانی اول و تا چند سالی بعد از آن، بخش‌های وسیعی از ایران عرصهٔ رویارویی نظامیان بیگانه و آشوب‌های محلی برآمده از این مداخلات بود، ولی در این میان آنچه در ارومیه گذشت، از لحاظ شدت مصائب و استمرار بلایا با هیچ‌یک از تحولات مشابهی که در آن دوره در دیگر نقاط کشور جریان داشت، قابل‌قیاس نیست. یادداشت‌های روزانۀ «رحمت‌الله‌خان معتمدالوزواره»، کفیل کارگزاری ارومیه و شاهد عینی این رخدادها، گواهی بر این امر است.",
        review: "ملّتی که تاریخ خود را نداند، محکوم به تکرار آن خواهد بود. اتفاقات بسیار تلخ و دلهره آوری که در طول تاریخ بر سر مردم شهرم آمده، قلب هر انسانی را به درد میاورد و امیدوارم هیچوقت این اتفاقات دوباره رخ دهند.  ",
        rating: 5

    },
    {
        title: "آذربایجان بایاتیلاری",
        author: "بهرام اسدی، بهلول عبداله، قیزیل گول بابازاده، ائلخان ممدلی",
        category: "poetry",
        cover: "/images/books/bayati.png",
        description: "مجموع اشعار دو بیتی به زبان ترکی در موضوعات مختلف",
        rating: 4

    },
    {
        title: "سمفونی مردگان",
        author: "عباس معروفی",
        category: "novel",
        cover: "/images/books/samfooni.png",
        description: "کتاب سمفونی مردگان نوشته‌ی عباس معروفی یکی از مهم‌ترین رمان‌های ادبیات معاصر ایران است. این اثر که همواره ستایش شده است و جوایز بسیاری را از آن خود کرده است، داستان زندگی خانواده‌ای را روایت می‌کند که در میانشان غوغایی به پا می‌شود و آتش اختلافات فکری بینشان شعله می‌کشد. این کتاب به زبان‌های مختلف از جمله انگلیسی، آلمانی، عربی و ایتالیایی ترجمه شده است. در سال ۲۰۰۱ توانست جایزه بنیاد انتشارات ادبی فلسفی سورکامپ را از آن خود کند و در سال ۲۰۰۲ جایزه بنیاد ادبی اشتفان تسوایک را از آن خود کرد. رمان سمفونی مردگان از سوی انتشارات ققنوس منتشر شده است",
        review: "بهترین کتابی که تو عمرم خوندم. عمیق ترین جملات و تاثیرگذارترین دیالوگ ها. از اون کتاب هایی هست که تا سالیان دراز در ذهنم میمونه.",
        rating: 5

    },
    {
        title: "الگوریتم ها",
        author: "رابرت سجویک و کوین وین",
        category: "computer science",
        cover: "/images/books/algorithms.png",
        description: "این کتاب قصد دارد مهم‌ترین الگوریتم‌های کامپیوتری مورد استفاده امروزی را بررسی کند و تکنیک‌های اساسی را به تعداد فزاینده‌ای از افرادی که نیاز به دانستن آنها دارند، آموزش دهد.",
        rating: 4

    },
    {
        title: "پدر پولدار پدر بی پول",
        author: "رابرت تی کی یوساکی",
        category: "psychology",
        cover: "/images/books/father.png",
        description: "کتاب پدر پولدار پدر بی پول، اثری نوشته ی رابرت تی کی یوساکی است که اولین بار در سال 1997 منتشر شد. کی یوساکی در این کتاب که فروشی بیش از 36 میلیون نسخه داشته، داستان دو پدر خود را نقل می کند: پدر واقعی اش، که او را «پدر بی پول» می نامد، و پدر بهترین دوستش که به راهنما و «پدر پولدار» او تبدیل شد. یکی از این مردان، تحصیل کرده بود و تمام عمر خود را به عنوان یک کارمند گذرانده بود، در حالی که دیگری، از تجارب خود در زندگی درس آموخته بود و مسیر کارآفرینی را طی می کرد؛ مسیری که او را به یکی از ثروتمندترین مردان در هاوایی تبدیل کرد.",
        rating: 3

    },
    {
        title: "کیمیاگر",
        author: "پائولو گوئیلو",
        category: "novel",
        cover: "/images/books/alchemist.png",
        description: "کتاب کیمیاگر اثر پائولو کوئیلو رمانی مشهور و پرطرفدار در باب کشف زندگی و رسیدن به رویاهاست. این رمان به قلم پائولو کوئیلو، نویسنده‌ی برزیلی خلق شده و در سراسر دنیا به چنان محبوبیتی رسیده که جزو پرفروش‌ترین و ترجمه‌شده‌ترین رمان‌های تاریخ به شمار می‌رود. کیمیاگر روایت داستان زندگی پسر جوانی به نام سانتیاگو است. سانتیاگو همه‌چیز را رها می‌کند و برای پیدا کردن گنج به سفری دور و دراز و عجیب می‌رود؛ سفری که ماجراها و درس‌های زیادی برای او دارد.",
        rating: 5

    },
    {
        title: "قلعه حیوانات",
        author: "جورج اورول",
        category: "novel",
        cover: "/images/books/animal.png",
        description: "کتاب قلعه حیوانات یک رمان کوتاه انگلیسی نوشته جورج اورول است. این رمان یکی از مهم‌ترین رمان‌های سیاسی قرن نوزدهم است که در سال ۱۹۴۵ منتشر شد. اثری تمثیلی، هجوآمیز و در نقد تمامیت‌خواهی و شعارهای پوچ کمونیستی است. این کتاب داستان حیوانات یک مزرعه است که صاحب ظالم خود را با اتحاد و تحت رهبری خوک‌ها فراری می‌دهند، اما دچار نوع دیگری از ستم و استثمار می‌شوند",
        review: "جمله معروف: همه حیوانات برابرند ولی بعضی ها برابرترند",
        rating: 5

    },
    {
        title: "چشم هایش",
        author: "بزرگ علوی",
        category: "novel",
        cover: "/images/books/eyes.png",
        description: "کتاب چشم هایش، رمانی نوشته ی بزرگ علوی است که اولین بار در سال 1952 به چاپ رسید. این رمان جاودان و ارزشمند، داستان دختری از طبقه ی مرفه جامعه ی ایران به نام فرنگیس را روایت می کند که زندگی پُر ناز و نعمتش، باعث شده که او مهارت خاصی برای درآوردن پول نداشته باشد. او با ناامیدی در یک دانشکده ی هنری در پاریس حضور می یابد و متوجه می شود که نقص ها و اشکالات زیادی در کار او به عنوان یک نقاش وجود دارد. او به ایران باز می گردد تا در فعالیت های سیاسی استاد ماکان، برجسته ترین نقاش ایران، مشارکتی داشته باشد.",
        rating: 4

    },
    {
        title: "اسب سیاه",
        author: "تاد رز",
        category: "psychology",
        cover: "/images/books/horse.png",
        description: "در «اسب سیاه»، اوگی اگاس و تاد رز، مفاهیم متعارف موفقیت را بازتعریف می‌کنند و دیدگاهی توانمند در مورد موفقیت شخصی در اختیار خوانندگان قرار می‌دهند. این دیدگاه در مسیر موفقیت، فراتر از روایت‌های سنتی است و نقشهٔ راهی را برای افراد ارائه می‌کند تا نقاط قوت، ارزش‌ها و علایق منحصربه‌فرد خود را در پی تحقق واقعی کشف کنند. در قلب این کتاب، مفهوم «اسب سیاه» وجود دارد؛ فردی که انتظارات جامعه را نادیده گرفته و مسیر موفقیت خود را کشف می‌کند. اگاس و رز از انبوهی از تحقیقات، داستان‌های شخصی و مطالعات موردی استفاده می‌کنند تا نشان‌دهند که چگونه اسب‌های سیاه با چالش‌های زندگی روبه‌رو شده و با پذیرش فردیت خود، به‌جای انطباق با هنجارهای اجتماعی، به موفقیت می‌رسند.",
        rating: 3

    },
    {
        title: "بنویس تا اتفا بیفتد",
        author: "هنریت کلاوسر",
        category: "psychology",
        cover: "/images/books/write.png",
        description: " دکتر کلاوسر در این کتاب بسیار موفق توضیح می دهد که عمل ساده ی نوشتن اهدافتان در زندگی، تا چه حد می تواند به شما در رسیدن به آن ها کمک کند. نوشتن حتی می تواند به شما کمک کند که بفهمید واقعاً چه چیزهایی را می خواهید به دست آورید. در این کتاب، داستان هایی درباره ی افرادی عادی خواهید خواند که پس از اجرای ایده ی ساده ی ثبت رویاهایشان بر روی کاغذ، شاهد به وقوع پیوستن معجزات ریز و درشت زیادی در زندگی شان بوده اند. راهنمایی های ملموس و تمرین های بسیار ساده ی دکتر هنریت کلاوسر بدون تردید می تواند خلاقیت خفته ی هر کسی را بیدار سازد. با کتاب بنویس تا اتفاق بیفتد، خواهید توانست شریک زندگی ایده آل خود را بیابید، شغلی جدید و عالی پیدا کنید، خوشحالتر از خواب برخیزید و به آرزوهایتان از همیشه نزدیکتر شوید.",
        review: "مسیر نوشتن من بعد از خواندن این کتاب شد که تاثیر نوشتن و برنامه ریزی روزانه را میتوانم الان حس کنم.",
        rating: 5

    },
    {
        title: "مجموعه کتاب های تالار وحشت",
        author: "آر.ال.استاین",
        category: "novel",
        cover: "/images/books/room.png",
        description: "در دست خود کلیدی داری که در را به روی دنیای وحشت و هراس میگشاید. در را به روی وحشت باز کن. همیشه جا برای یک نفر دیگر در تالار وحشت وجود دارد.",
        review: "اولین سری کتابی که خوندم و شوق و ذوق خواندن را در وجود من نهادینه کرد.",
        rating: 5

    },
    
] 
